Desktop/w4d2/cats99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.create(cat_params)
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = ?, "description" = ?, "color" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["birth_date", "1990-01-01"], ["description", " c00lkitty "], ["color", "calico"], ["updated_at", "2018-07-11 00:32:51.394123"], ["id", 1]]